---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertToDouble
source: html/88c0876f-0999-547a-5cff-72e895c67acf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertToDouble Property

Cannot convert '[Text] ' to double value

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConvertToDouble { get; }
```